Supongamos que una universidad toma una muestra de las calificaciones de los estudiantes para una clase de ciencia de datos.

In [1]:
data = [50,50,47,97,49,3,53,42,26,74,82,62,37,15,70,27,36,35,48,52,63,64]
print(data)

[50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]

**Los datos se cargaron en una estructura de lista** Python, que es un buen tipo de datos para la manipulación general de datos, pero no está optimizado para el análisis numérico. Para eso, vamos a utilizar el paquete **NumPy**, que incluye funciones y tipos de datos específicos para trabajar con *Números* en Python.

Ejecute la celda a contunación para recargar los datos en una **matriz** NumPy.

In [2]:
import numpy as np 
grades = np.array(data)
print(grades)

[50 50 47 97 49  3 53 42 26 74 82 62 37 15 70 27 36 35 48 52 63 64]

En caso de que se esté preguntando acerca de las diferencia entre una lista y una matriz NumPy, comparemos cómo se comporatan estos tipos de datos cuando los usamos en una expresión que los multiplica por 2.

In [3]:
print(type(data), 'x 2: ', data *2)
print('---')
print(type(grades), 'x 2: ', grades *2)

<class 'list'> x 2:  [50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64, 50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64]
---
<class 'numpy.ndarray'> x 2:  [100 100  94 194  98   6 106  84  52 148 164 124  74  30 140  54  72  70
  96 104 126 128]

Tenga en cuenta que multiplicar una lista por 2 crea una nueva lista del doble de longitud con la secuencia original de elementos de la lista repetida. Multiplicar uan matriz NumPy, por otro lado, realiza un cálculo por elementos en el que la matriz se comporta como un *vector*, por lo que terminamos con una matriz del mismo tamaño enla que cada elemento se ha multiplicado por 2.

La conclusión clave de esto es que las matrices NumPy están diseñadas específicamente para admitir operaciones matemáticas en datos numéricos, lo que hace más útiles para el análisis de datos que una lista genérica.

Es posible que haya notado que el tipo de clase para la matriz numpy anterior es **numpy.ndarray**. El **nd** indica que se trata de una estructura que puede constar de múltiples *dimensiones* (puede tener *n* dimensiones). Nuestra instancia especifica tiene una sola dimensión de calificaciones de los estudiantes.

Ejecuta la celda de abajo para ver la **forma** matiz.

In [4]:
grades.shape

(22,)

La forma confirma que esta matriz tiene solo una dimensión, que contiene 22 elementos (hay 22 grados en la lista original). Puede acceder a los elementos individuales de la matriz por su posición ordinal de base cero. Obtenemos el primer elemento (el que está en la posición 0).

In [5]:
grades [0]

50

Muy bien, ahora que conoce la matriz NumPy, es hora de realizar un análisis de los datos de calificaciones.

Puede aplicar agregaciones a los elementos de la matriz, así que encontremos la calificación promedio simple (en otras palabras, el valor de la calificación *media*).

In [6]:
grades.mean()

49.18181818181818

Entonces, la calificación media es alrededor de 50, más o menos en el medio del rango posible de 0 a 100.

Agreguemos un segundo conjunto de datos para los mismos estudiantes, esta vez registrando la cntidad típica de horas por semana que dedicaron a estudiar.

In [7]:
# Definir una matriz de horas de estudio
study_hours = [10.0,11.5,9.0,16.0,9.25,1.0,11.5,9.0,8.5,14.5,15.5,
               13.75,9.0,8.0,15.5,8.0,9.0,6.0,10.0,12.0,12.5,12.0]
# Crear una matriz 2D (una matriz de matrices)
data_students = np.array([study_hours, grades])

# Mostrar la matriz
data_students

array([[10.  , 11.5 ,  9.  , 16.  ,  9.25,  1.  , 11.5 ,  9.  ,  8.5 ,
        14.5 , 15.5 , 13.75,  9.  ,  8.  , 15.5 ,  8.  ,  9.  ,  6.  ,
        10.  , 12.  , 12.5 , 12.  ],
       [50.  , 50.  , 47.  , 97.  , 49.  ,  3.  , 53.  , 42.  , 26.  ,
        74.  , 82.  , 62.  , 37.  , 15.  , 70.  , 27.  , 36.  , 35.  ,
        48.  , 52.  , 63.  , 64.  ]])

Ahora los datos consisten en una matriz bidimensional: una matriz de matrices. Veamos su forma.

In [8]:
data_students.shape

(2, 22)

La matriz **student_data** contiene dos elementos, cada uno de los cuales es una matriz que contiene 22 elementos. 

Para navegar por esta estructura, debe especificar la posición de cada elemento en la jerarquía. Entonces, para encontrar el primer valor en la primera matriz (que contiene los datos de las horas de estudio), puede usar el siguiente código.

In [9]:
# Mostrar el primer elemento del primer elemento 
data_students [0][0]

10.0

Ahora tiene una matriz muldimensional que contiene tanto el tiempo de estudio del estudiante como la información de calificaciones, que puede usar para comparar datos. Por ejemplo, ¿cómo se compara el teimpo medio de estudio con l anota media?.

In [10]:
# Obtener el valor medio de cada subarreglo
mean_study = data_students [0].mean()
mean_grade = data_students [1].mean()

print('Promedio de horas de estudio {:.2f}\nPromedio de calificaciones : {:.2f}'. format (mean_study, mean_grade))

Promedio de horas de estudio 10.52
Promedio de calificaciones : 49.18

# Explorando datos tabulares con Pandas

In [11]:
import pandas as pd

df_students = pd.DataFrame({'Name': ['Dan', 'Joann', 'Pedro', 'Rosie', 'Ethan', 'Vicky', 'Frederic', 'Jimmie', 
                                     'Rhonda', 'Giovanni', 'Francesca', 'Rajab', 'Naiyana', 'Kian', 'Jenny',
                                     'Jakeem','Helena','Ismat','Anila','Skye','Daniel','Aisha'],
                            'StudyHours':data_students[0],
                            'Grade':data_students[1]})

df_students

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
12    Naiyana        9.00   37.0
13       Kian        8.00   15.0
14      Jenny       15.50   70.0
15     Jakeem        8.00   27.0
16     Helena        9.00   36.0
17      Ismat        6.00   35.0
18      Anila       10.00   48.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

Tenga en cuenta que, además de las columnas que especificó, el DataFrame incluye un índice para identificar de forma única cada fila. Podríamos haber especificado el índice esplícitamente y asignado cualquier tipo de valor entero único para cada fila. 

#### Encontrar y filtara datos en un DataFrame
puede usar el método **loc** para recuperar datos para un valor de índice específico, como este.

In [12]:
# Obtenga los datos para el valor índice 5
df_students.loc[5]

Name          Vicky
StudyHours      1.0
Grade           3.0
Name: 5, dtype: object

También puede obtener los datos en un rango de valores de índice, como este:

In [13]:
# Obtenga las filas co nvalores de índice de o a 5
df_students.loc[0:5]

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0
5  Vicky        1.00    3.0

Además des poder usar el método **loc** para buscar filas según el índice, puede usar el método **ilox** para buscar filas según su posición ordinal en el DataFrame (*independientemente del índice*):

In [14]:
# Obtener datos en las primeras cinco filas
df_students.iloc[0:5]

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0

Mire cuidadosamente los `iloc[0:5]` resultados y compárelos con los `loc[0:5]` resultados que obtuvo anteriormente. ¿Puedes ver la diferencia?

El método **loc** devolvió filas con *etiqueta* de índice en la lista de valores del *0* al *5*, que incluye *0*, *1*, *2*, *3*, *4* y *5* (*seis filas*). Sin embargo, el método **iloc** devuelve las filas en las posiciones incluidas en el rango de 0 a 5, y dado que los rangos de enteros no incluyen el valor del límite superior, esto incluye las posiciones *0, *1*, *2*, *3* y *4* (cinco filas).

**iloc** idenfifica valores de datos en un DataFrame por *posición*, que se extiende más allá de las filas a las columnas. Entonces, por ejemplo puede usarlos para encontrar los valores de las columnas en las posiciones 1 y 2 en la fila 0, así:

In [15]:
df_students.iloc[0,[1,2]]

StudyHours    10.0
Grade         50.0
Name: 0, dtype: object

Volvamos al método **loc y veamos cómo funciona con las columnas**. Recuerde que **loc** se usa para ubicar elementos de datos en función de valores de índice en lugar de posiciones. En ausencia de una columna índice explícita, las filas en nuestro marco de datos se indexan como valores enteros, pero las columnas se identifican por nombre:

In [16]:
df_students.loc[0,'Grade']

50.0

Aquí hay otro truco útil. Puede usar el méodo **loc** pra encontrar filas indexadas en función de una expresión de filtrado que hac referencia a columnas nombradas distintas del índice, como esta:

In [17]:
df_students.loc[df_students['Name']=='Aisha']

     Name  StudyHours  Grade
21  Aisha        12.0   64.0

Y en buena medida, puede lograr los mismos resultados utilizando el método de **consulta** de DataFrame, como este:

In [18]:
df_students.query('Name=="Aisha"')

     Name  StudyHours  Grade
21  Aisha        12.0   64.0

Los tres ejemplos anteriores subrayan una verdad ocasionalmente confusa sobre trabajas con Pandas. A menudo, hay varias formas de lograr los mismos resultados. Otro ejemplo de este es la forma en que se refuere a un nombre de clomna de DataFrame. Puede especificar el nombre de la columna como un valor de índice con nombre (como en los `df_students['Name']` ejemplos que hemos visto hata ahora), o puede usar la columna como una propiedad del DataFrame, así:

In [19]:
df_students[df_students.Name == 'Aisha']

     Name  StudyHours  Grade
21  Aisha        12.0   64.0

#### Cargando un DataFrame desde un archivo
Construimos el DataFrame a partir de algunos arreglos existentes. Sin embargo, en muchos escenarios del mundo real, los datos se cargan desde fuentes como archivos. Reemplacemos el DataFrame de calificaciones de los estudiantes con el contenido de un archivo de texto.

In [20]:
#!wget https://raw.githubusercontent.com/MicrosoftDocs/mslearn-introduction-to-machine-learning/main/Data/ml-basics/grades.csv
#df_students = pd.read_csv('grades.csv',delimiter=',',header='infer')
url = "https://raw.githubusercontent.com/MicrosoftDocs/mslearn-introduction-to-machine-learning/main/Data/ml-basics/grades.csv"
df_students = pd.read_csv(url,delimiter=',',header='infer')
df_students.head()

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0

El método **read_csv** de **DataFrame** se usa para cargar datos de archivo de texto. Como puede ver en el lcódigo de ejemplo, puede especificar opciones como el delimitador de columna y qué fila (si la hay) contiene encabezados de columna (en este caso, el delimitador es una coma y la primera fila contiene los nombres de columna; estos son los configuración perdeterminada, por lo que los parámetros podrían haberse omitido).

#### Manejo de valores faltantes

Uno de los problemas más comunes cno los que deben lidiar los científicos de datos son los datos incompletos o faltantes. Entonces, ¿cómo sabríamos que el DataFrame contiene valores faltantes? Puede usar el método **isnull** para identificar qué valores indivuduales no nulos, así:

In [21]:
df_students.isnull()

     Name  StudyHours  Grade
0   False       False  False
1   False       False  False
2   False       False  False
3   False       False  False
4   False       False  False
5   False       False  False
6   False       False  False
7   False       False  False
8   False       False  False
9   False       False  False
10  False       False  False
11  False       False  False
12  False       False  False
13  False       False  False
14  False       False  False
15  False       False  False
16  False       False  False
17  False       False  False
18  False       False  False
19  False       False  False
20  False       False  False
21  False       False  False
22  False       False   True
23  False        True   True

Por supuesto, con un DataFrame más grande, sería ineficiente revisar todas las filas columnas individualmente; para que podamos obtener la suma de valores faltantes para cada columna, así:

In [22]:
df_students.isnull().sum()

Name          0
StudyHours    1
Grade         2
dtype: int64

Así que ahora sabemos que falta **un valor de Horas** de estudio y dos valores de **Grado faltantes.**

Para verlos en contexto, podemos filtrar el marco de datos para incluir solo filas donde cualquiera de las comunas (eje 1 del  marco de datos) es nula.

In [23]:
df_students[df_students.isnull().any(axis=1)]

    Name  StudyHours  Grade
22  Bill         8.0    NaN
23   Ted         NaN    NaN

Cuando se rescupera el marco de datos, los valores numéricos que faltan se muestran como **NaN** (*no un número*).

Entonces, ahora que hemos encontrado los valores nulos, ¿qué podamos hacer al respecto?

Un enfoque común es *imputar* valores de reemplazo. Por ejemplo, si falta el número de horas de estudio, podríamos suponer que el estudiantes estudió una cantidad de tiempo promedio y reemplazar el valore que falta con el promedio de horas de estudio. Para hacer esto, podemos usar el método **filna**, así:

In [24]:
df_students.StudyHours = df_students.StudyHours.fillna(df_students.StudyHours.mean())
df_students
df

         Name  StudyHours  Grade
0         Dan   10.000000   50.0
1       Joann   11.500000   50.0
2       Pedro    9.000000   47.0
3       Rosie   16.000000   97.0
4       Ethan    9.250000   49.0
5       Vicky    1.000000    3.0
6    Frederic   11.500000   53.0
7      Jimmie    9.000000   42.0
8      Rhonda    8.500000   26.0
9    Giovanni   14.500000   74.0
10  Francesca   15.500000   82.0
11      Rajab   13.750000   62.0
12    Naiyana    9.000000   37.0
13       Kian    8.000000   15.0
14      Jenny   15.500000   70.0
15     Jakeem    8.000000   27.0
16     Helena    9.000000   36.0
17      Ismat    6.000000   35.0
18      Anila   10.000000   48.0
19       Skye   12.000000   52.0
20     Daniel   12.500000   63.0
21      Aisha   12.000000   64.0
22       Bill    8.000000    NaN
23        Ted   10.413043    NaN

Alternativamente, puese ser importante asegurarse de que solo usa datos que sabe que son absolutamente correctos; para que pueda soltar fila o columnas que contengan valores nulos usando el método **dropna**. En este caso, eliminaremos las filas (eje del DataFrame) donde alguna de las columnas contenga valores nulos.

In [25]:
df_students = df_students.dropna(axis=0, how='any')
df_students

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
12    Naiyana        9.00   37.0
13       Kian        8.00   15.0
14      Jenny       15.50   70.0
15     Jakeem        8.00   27.0
16     Helena        9.00   36.0
17      Ismat        6.00   35.0
18      Anila       10.00   48.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

#### Explorardatos en el DataFrame

Ahora que hemos limpiado los valores faltantes, estamos listos para explorar los datos en el DataFrame. Empecemos por compara as horas medias de estudio y las notas.

In [26]:
# Obtenga el promedio de horas de estudio usando el nombre de la columna como índice
mean_study = df_students['StudyHours'].mean()

# Obtenga la calificación media usando el nombre de la comuna como una propiedad (¡solo para acalarar el punto!)
mean_grade = df_students.Grade.mean()

# Imprime la media de horas de estudio y la nota media
print('Horas de estudio semanales promedio: {:.2f}\nCalificación promedio: {:.2f}'.format(mean_study,mean_grade))

Horas de estudio semanales promedio: 10.52
Calificación promedio: 49.18

Bien, filtremos el DataFrame para encontrar solo a los estudiantes que estudiaron por más tiempo que el promedio.

In [27]:
# Obtener estudiantes que estudiaron la media o más horas
df_students [df_students.StudyHours > mean_study]

         Name  StudyHours  Grade
1       Joann       11.50   50.0
3       Rosie       16.00   97.0
6    Frederic       11.50   53.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
14      Jenny       15.50   70.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

Tenga en cuenta que el resultado friltrado es en sí mismo un DataFrame, por lo que puede trabajar con sus columnas como cualquiera otro DataFrame.

Por ejemplo, busquemos la calificación promedio de los estudiantes que dedicaron más tiempo de estudio que el promedio.

In [28]:
# ¿Cuál fue su nota media?
df_students[df_students.StudyHours > mean_study].Grade.mean()

66.7

Supongamos que la calificación aprobatoria por el curso es 60. 

Podemos usar esa información para agregar una nueva columna al DataFrame, indicando si cada estudiante aprobó o on.

Primero, crearemos una **Serie** Pandas que contenga el indicador de aprobación/rechazo (Verdadero o Falso), y luego concatenaremos esa serie como una nueva columna (eje 1) en el DataFrame).

In [29]:
passes = pd.Series(df_students['Grade']>=60)
##df_students = pd.concat([df_students, passes.rename("Pass")],axis=1)
df_students

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
12    Naiyana        9.00   37.0
13       Kian        8.00   15.0
14      Jenny       15.50   70.0
15     Jakeem        8.00   27.0
16     Helena        9.00   36.0
17      Ismat        6.00   35.0
18      Anila       10.00   48.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

Los marcos de datos están diseñados para datos tabulares y puede usarlos para realizar muchos de los ipos de operaciones de análisis de datos que puede realizar en un base de datos relacional; como agrupar y agregar tablas de datos. 

Por ejemplo, puede usar el método **groupby** para agrupar los datos de los estudiantes en grupas según la columna **Aprobado** que agregó anteriormente y contar la cantidad de nombres en cada grupo; en otras palabras, puede determinar cuántos estudiantes aprobaron y reprobaron.

In [30]:
df_students
#print(df_students.groupby(df_students.Pass).Name.count())

         Name  StudyHours  Grade
0         Dan       10.00   50.0
1       Joann       11.50   50.0
2       Pedro        9.00   47.0
3       Rosie       16.00   97.0
4       Ethan        9.25   49.0
5       Vicky        1.00    3.0
6    Frederic       11.50   53.0
7      Jimmie        9.00   42.0
8      Rhonda        8.50   26.0
9    Giovanni       14.50   74.0
10  Francesca       15.50   82.0
11      Rajab       13.75   62.0
12    Naiyana        9.00   37.0
13       Kian        8.00   15.0
14      Jenny       15.50   70.0
15     Jakeem        8.00   27.0
16     Helena        9.00   36.0
17      Ismat        6.00   35.0
18      Anila       10.00   48.0
19       Skye       12.00   52.0
20     Daniel       12.50   63.0
21      Aisha       12.00   64.0

In [31]:
print(df_students.groupby(df_students.Pass).Name.count())

AttributeError: 'DataFrame' object has no attribute 'Pass'

Puede agregar varios campos en un grupo utilizando cualquier función de agregación disponible. Por ejemplo, puede encontrar el tiempo medio de estudi oy la calificación de los grupos de estudiantes que aprobaron y reprobaron el curso.

In [ ]:
print(df_students.groupby(df_students.Pass)['StudyHours', 'Grade'].mean())

Los marcos de datos son increíblemente versátiles y facilitan la manipulación de datos. Muchas operaciones de DataFrame devuelven una nueva copia de DataFrame; entonces, si desea modificar un DataFrame pero mantener la varialbe existente, debe asignar el resultado de la operación a la variable existente. Por ejemplo, el siguiente código ordena los datos de los estudiantes en orden descendente de grado y asigna el marco de datos ordenado resultante a la variable original **df_students**.

In [ ]:
# Crear un DataFrame con los datos ordenados por Grado (descendente)
df_students = df_students.sort_values('Grade', ascending=False)

# Muestra el DataFrame
df_students

#### Resumen

¡Eso es todo por ahora!

Numpy y DataFrame son los caballeros de batalla de la ciencia de datos en Python. Nos proporcionan formas de cargar, explorar y analizar datos tabulares. Como veremos un módulos posteriores, incluso los métodos de análisis avanzados suelen depender de Numpy y Pandas para estas importantes funciones.

Es nestro próximo libro de trabajo, veremos cómo crear gráficos y explorar su datos de maneras más interesantes.